{"class_name": "Model", "config": {"name": "model", "layers": [{"name": "in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 35], "dtype": "float32", "sparse": false, "name": "in"}, "inbound_nodes": []}, {"name": "dense1", "class_name": "Dense", "config": {"name": "dense1", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["in", 0, 0, {}]]}, {"name": "reshape", "class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [100, 1]}, "inbound_nodes": [["dense1", 0, 0, {}]]}, {"name": "locally_connected1d", "class_name": "LocallyConnected1D", "config": {"name": "locally_connected1d", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [10], "strides": [5], "padding": "valid", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "implementation": 1}, "inbound_nodes": [["reshape", 0, 0, {}]]}, {"name": "locally_connected1d_1", "class_name": "LocallyConnected1D", "config": {"name": "locally_connected1d_1", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "implementation": 1}, "inbound_nodes": [["locally_connected1d", 0, 0, {}]]}, {"name": "flatten", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [["locally_connected1d_1", 0, 0, {}]]}, {"name": "dense2", "class_name": "Dense", "config": {"name": "dense2", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["flatten", 0, 0, {}]]}, {"name": "output", "class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["dense2", 0, 0, {}]]}], "input_layers": ["in", 0, 0], "output_layers": ["output", 0, 0]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}