{"class_name": "Model", "config": {"name": "model", "layers": [{"name": "in1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "name": "in1"}, "inbound_nodes": []}, {"name": "in2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "name": "in2"}, "inbound_nodes": []}, {"name": "in1_dense", "class_name": "Dense", "config": {"name": "in1_dense", "trainable": true, "dtype": "float32", "units": 5, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["in1", 0, 0, {}]]}, {"name": "in2_dense", "class_name": "Dense", "config": {"name": "in2_dense", "trainable": true, "dtype": "float32", "units": 10, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["in2", 0, 0, {}]]}, {"name": "merge", "class_name": "Concatenate", "config": {"name": "merge", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["in1_dense", 0, 0, {}], ["in2_dense", 0, 0, {}]]]}, {"name": "dense3", "class_name": "Dense", "config": {"name": "dense3", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["merge", 0, 0, {}]]}], "input_layers": [["in1", 0, 0], ["in2", 0, 0]], "output_layers": ["dense3", 0, 0]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}